# coding: utf-8

# COMMON STRINGS #
common_welcome_text = """Привіт, якщо хочете додати нове нагадування, введіть команду /new_event 
P.S.На даний момент, ви можете додати максимум 5 нагадувань """

common_guide_timezone = """Вкажіть часовий пояс в форматі +х або -х)
P.S  Часовий пояс необхідно ввести відносно GMT+0\n"""

common_guide_time = """Вкажіть час нагадування. Наприклад:\n
1. 20:00 - Нагадування сьогодні у вказаній годині
2. 15:57 20.12.2016 - Нагадування у ваказаний день та годині\n"""

common_is_time_correct = """Не можу визначити дату і час  {0!s}\n
                        Якщо все вірно, введіть текст нагадування.\n
                        Натисніть /cancel і спробуйте ще раз"""

common_timezone_set = 'Часовий пояс збережено, дякую!'
common_cancel = 'Окей, давайте спробуємо ще раз'
common_note_added = 'Нагадування додано, вам прийде нагадування {0!s}'

# ERROR & EXCEPTIONS

error_note_too_long = 'Нагадування не може бути більшим за  1000 симвлів \n'
error_date_in_past = 'упс, я не можу зберегти дату з минулого!'
error_timezone_not_recognized = 'Щось не так з часовим поясом, спробуй ввести його зе раз'
error_time_not_recognized = 'Здається, ти ввів не правильно час, перевір, та введи ще раз'
error_timezone_not_set = 'Хтось забув ввести часовий пояс, будь ласка введи /set_offset і встанови його, дякую...  '
error_could_not_save_note = 'Не вдалось зберегти нагадуваня в базі, спробуй ще раз'
error_after_2022 = 'Не можна вказати дату пізніше 01.01.2022'
error_incorrect_input = 'Дата або час вказані невірно, перевір ще раз'
error_incorrect_date = 'Не існує такої дати'
